{
  "words": [
    {
      "title": "Address (1)",
      "description": "n. 1. A number specifying a location in memory where data is stored. See also absolute address, address space, physical address, virtual address. 2. A name or token specifying a particular computer or site on the Internet or other network. 3. A code used to specify an e-mail destination."
    },
    {
      "title": "Address (2)",
      "description": "vb. To reference a particular storage location"
    },
    {
      "title": "Addressable cursor",
      "description": "n. A cursor programmed so that it can be moved to any location on the screen, by means of the keyboard or a mouse."
    },
    {
      "title": "Address book",
      "description": "n. 1. In an e-mail program, a reference section listing e-mail addresses and individuals’ names. 2. As a Web page, an informal e-mail or URL phone book."
    },
    {
      "title": "Address bus",
      "description": "n. A bus consisting of 20 to 64 separate hardware lines that is used to carry the signals specifying memory locations for data. See also bus."
    },
    {
      "title": "Address classes",
      "description": "n. Predefined groupings of Internet addresses with each class defining networks of a certain size. The range of numbers that can be assigned for the first octet in the IP address is based on the address class. Class A networks (values 1 to 126) are the largest, with more than 16 million hosts per network. Class B networks (128 to 191) have up to 65,534 hosts per network, and Class C networks (192 to 223) can have up to 254 hosts per network."
    },
    {
      "title": "Address decoder ",
      "description": "n. An electronic device that converts a numeric address to the electrical signals needed to select a specific memory location on one or more RAM chips."
    },
    {
      "title": "Addressing",
      "description": "n. The process of assigning or referring to an address. In programming, the address is typically a value specifying a memory location. See also address."
    },
    {
      "title": "Address mapping table",
      "description": "n. A table used by routers or DNS (Domain Name System) servers to obtain the corresponding IP (Internet Protocol) address of a text name of a computer resource, such as the name of a host computer on the Internet. Acronym: AMT.See also DNS server, IP address, router"
    },
    {
      "title": "Address mark",
      "description": "n. See index mark."
    },
    {
      "title": "Address mask",
      "description": "n. A number that, when compared by the computer with a network address number, will block out all but the necessary information. For example, in a network that uses XXX.XXX.XXX.YYY and where all computers within the network use the same first address numbers, the mask will block out XXX.XXX.XXX and use only the significant numbers in the address, YYY. See also address (definition 2)"
    },
    {
      "title": "Address mode",
      "description": "n. The method used to indicate an address in memory. See also absolute address, indexed address, paged address, relative address."
    },
    {
      "title": "Address modification",
      "description": "n. The process of updating an address of a location in memory during computation."
    },
    {
      "title": "Address munging",
      "description": "n. The practice of modifying an e-mail address in posts to newsgroups or other Internet forums to foil computer programs that gather e-mail addresses. The host name in an e-mail address is altered to create a fictitious address in such a way that a human can still easily determine the correct address. For example, a person with an e-mail address of Jane@myispoffersusersfreeemail.com could modify, or “mung,” her address to read Jane@remove-this-to-reply-myispoffersusersfreeemail.com. Address munging is generally used to prevent delivery of unsolicited junk e-mail or spam. Also called: munging. See also address1 (definition 2), host name, mung, spam."
    },
    {
      "title": "Address register",
      "description": "n. A register (a high-speed memory circuit) that holds an address where specific data can be found for the transfer of information. See also register."
    },
    {
      "title": "Address resolution",
      "description": "n. The identification of a computer’s IP (Internet Protocol) address by finding the corresponding match in an address mapping table. See also address mapping table."
    },
    {
      "title": "Address Resolution Protocol",
      "description": "n. See ARP."
    },
    {
      "title": "Address space",
      "description": "n. The total range of memory locations addressable by a computer"
    },
    {
      "title": "Address translation",
      "description": "n. The process of converting one kind of address to another, such as a virtual address to a physical address."
    },
    {
      "title": "Ad-hoc network",
      "description": "n. A temporary network formed by communicating stations or computers in a wireless LAN. See also wireless LAN."
    },
    {
      "title": "ADJ",
      "description": "n. Short for adjacent. A Boolean qualifier to indicate cases where two instances are adjacent to each other. In the case of a search string, “Microsoft ADJ Word” would return only instances where “Microsoft” and “Word” are adjacent in the string."
    },
    {
      "title": "Administrative alerts",
      "description": "n. Alerts that relate to server and resource use. They notify users about problems in areas such as security and access, user sessions, server shutdown due to power loss (when an uninterruptible power supply is available), directory replication, and printing. When a computer generates an administrative alert, a message is sent to a predefined list of users and computers. See also Alerter service."
    },
    {
      "title": "ADN",
      "description": "n. See Advanced Digital Network."
    },
    {
      "title": "ADO",
      "description": "n. See Active data object. "
    },
    {
      "title": "Adobe Type Manager",
      "description": "n. Software from Adobe Systems, Inc., that manages PostScript fonts on a system. Acronym: ATM.See also PostScript"
    },
    {
      "title": "ADO.NET",
      "description": "n. The suite of data access technologies included in the .NET Framework class libraries that provide access to relational data and XML. ADO.NET consists of classes that make up the DataSet (such as tables, rows, columns, relations, and so on), .NET Framework data providers, and custom type definitions (such as SqlTypes for SQL Server)."
    },
    {
      "title": "ADP",
      "description": "n. See data processing."
    },
    {
      "title": "ADPCM",
      "description": "n. See adaptive delta pulse code modulation."
    },
    {
      "title": "ADSL",
      "description": "n. Acronym for asymmetric digital subscriber line. Technology and equipment allowing high-speed digital communication, including video signals, across an ordinary twisted-pair copper phone line, with speeds up to 8 Mbps (megabits per second) downstream (to the customer) and up to 640 Kbps (kilobits per second) upstream. ADSL access to the Internet is offered by some regional telephone companies, offering users faster connection times than those available through connections made over standard phone lines. Also called: asymmetric digital subscriber loop. Compare SDSL."
    },
    {
      "title": "Advanced Configuration and Power Interface",
      "description": "n. See ACPI."
    },
    {
      "title": "Advanced Digital Network",
      "description": "n. A dedicated line service capable of transmitting data, video, and other digital signals with exceptional reliability, offered as a premier service by communications companies. Usually Advanced Digital Network refers to speeds at or above 56 kilobits per second (Kbps). See also dedicated line."
    },
    {
      "title": "Advanced Encryption Standard",
      "description": "n. See AES."
    },
    {
      "title": "Advanced Interactive Executive",
      "description": "n. See AIX."
    },
    {
      "title": "Advanced Mobile Phone Service",
      "description": "n. See AMPS."
    },
    {
      "title": "Advanced Power Management",
      "description": "n. An older power management technology used in mobile PCs before the implementation of Advanced Configuration and Power Interface (ACPI). Advanced Power Management is a software interface that functions between the BIOS powermanagement software that is specific to the hardware and a power-management policy driver that is run by the operating system. Acronym: APM."
    },
    {
      "title": "Advanced Program-to-Program Communication",
      "description": "n. See APPC."
    },
    {
      "title": "Advanced Research Projects Agency Network",
      "description": "n. See ARPANET."
    },
    {
      "title": "Advanced RISC",
      "description": "n. Short for Advanced reduced instruction set computing. A specification for a RISC microchip architecture and system environment designed by MIPS Computer Systems to provide binary compatibility among software applications. See also RISC."
    },
    {
      "title": "Advanced RISC Computing Specification",
      "description": "n. The minimum hardware requirements enabling a RISC-based system to comply with the Advanced Computing Environment standard. See also Advanced RISC."
    },
    {
      "title": "Advanced RISC Machines",
      "description": "n. See ARM."
    },
    {
      "title": "Advanced SCSI Programming Interface",
      "description": "n. An interface specification developed by Adaptec, Inc., for sending commands to SCSI host adapters. The interface provides an abstraction layer that insulates the programmer from considerations of the particular host adapter used. Acronym: ASPI.See also adapter, SCSI."
    },
    {
      "title": "Advanced Streaming Format",
      "description": "n. An open file format specification for streaming multimedia files containing text, graphics, sound, video, and animation. Advanced Streaming Format (ASF) does not define the format for any media streams within the file. Rather, it defines a standardized, extensible file “container” that is not dependent on a particular operating system or communication protocol, or on a particular method (such as HTML or MPEG-4) used to compose the data stream in the file. An ASF file consists of three objects: a Header object containing information about the file itself, a Data object containing the media streams, and an optional Index object that can help support random access to data within the file. The ASF specification has been submitted to the ISO (International Organization for Standardization) for consideration. Acronym: ASF.See also streaming."
    },
    {
      "title": "Adventure game",
      "description": "n. A role-playing computer game in which the player becomes a character in a narrative. In order to complete the game, the player must solve problems and avoid or overcome attacks and other forms of interference from the game’s environment and other characters. The first adventure game was called “Adventure.” It was developed in 1976 by Will Crowther of Bolt, Baranek & Newman. See also arcade game, computer game, role-playing game."
    },
    {
      "title": "AE",
      "description": "n. Acronym for application entity. In the ISO/OSI reference model, one of the two software parties involved in a communications session. See also ISO/OSI reference model."
    },
    {
      "title": "A/E/C SYSTEMS conference",
      "description": "n. Annual conference of the architecture, engineering, and construction industry. The conference promotes the exchange of information on new techniques and technologies used by these industries."
    },
    {
      "title": ".aero",
      "description": "n. One of seven new top-level domain names approved in 2000 by the Internet Corporation for Assigned Names and Numbers (ICANN). .aero is meant for use with air-transport industry-related Web sites. The seven new domain names became available for use in the spring of 2001."
    },
    {
      "title": "AES",
      "description": "n. Acronym for Advanced Encryption Standard. A cryptographic algorithm specified by the National Institute of Standards and Technology (NIST) to protect sensitive information. AES is specified in three key sizes: 128, 192, and 256 bits. AES replaces the 56-bit key Data Encryption Standard (DES), which was adopted in 1976. See also DES."
    },
    {
      "title": "AFC",
      "description": "n. See Application Foundation Classes."
    },
    {
      "title": "AFDW",
      "description": "n. See Active Framework for Data Warehousing."
    },
    {
      "title": "affinity",
      "description": "n. For Network Load Balancing, the method used to associate client requests to cluster hosts. When no affinity is specified, all network requests are load balanced across the cluster without respect to their source. Affinity is implemented by directing all client requests from the same IP address to the same cluster host. See also client request, IP address."
    },
    {
      "title": "AFIPS",
      "description": "n. Acronym for American Federation of Information Processing Societies. An organization formed in 1961 for the advancement of computing and information-related concerns. The U.S. representative of the International Federation of Information Processing, AFIPS was replaced by the Federation on Computing in the United States (FOCUS) in 1990."
    },
    {
      "title": "AFK",
      "description": "adv. Acronym for away from keyboard. A phrase occasionally seen in live chat services on the Internet and online information services as an indication that one is momentarily unable to answer. See also chat1 (definition 1)."
    },
    {
      "title": "AFP",
      "description": "n. Acronym for AppleTalk Filing Protocol. A remote filing system protocol that provides a standard means for a workstation on an AppleTalk network to access and manipulate files on an AFP-implemented server. Also called: AppleShare File Server."
    },
    {
      "title": "AFS",
      "description": "n. Acronym for Andrew File System. A distributed file system that allows clients and servers to share resources through local-area and wide-area networks. AFS is based on a distributed file system developed at Carnegie- Mellon University, and is named for the university’s founders—Andrew Carnegie and Andrew Mellon. AFS is now maintained and supplied by Transarc Corporation. See also distributed file system."
    },
    {
      "title": "agent",
      "description": "n. 1. A program that performs a background task for a user and reports to the user when the task is done or some expected event has taken place. 2. A program that searches through archives or other repositories of information on a topic specified by the user. Agents of this sort are used most often on the Internet and are generally dedicated to searching a single type of information repository, such as postings on Usenet groups. Spiders are a type of agent used on the Internet. Also called: intelligent agent. See also spider. 3. In client/server applications, a process that mediates between the client and the server. 4. In Simple Network Management Protocol (SNMP), a program that monitors network traffic. See also SNMP."
    },
    {
      "title": "aggregated links",
      "description": "n. See link aggregation."
    },
    {
      "title": "aggregation of links",
      "description": "n. See link aggregation."
    },
    {
      "title": "AGP",
      "description": "n. Acronym for Accelerated Graphics Port. A high-performance bus specification designed for fast, high-quality display of 3-D and video images. Developed by Intel Corporation, AGP uses a dedicated point-to-point connection between the graphics controller and main system memory. This connection enables AGP-capable display adapters and compatible chip sets to transfer video data directly between system memory and adapter memory, to display images more quickly and smoothly than they can be displayed when the information must be transferred over the system’s primary (PCI) bus. AGP also allows for storing complex image elements such as texture maps in system memory and thus reduces the need for large amounts of memory on the adapter itself. AGP runs at 66 MHz— twice as fast as the PCI bus—and can support data transfer speeds of up to 533 Mbps. See also PCI local bus."
    },
    {
      "title": "AH ",
      "description": "Boîtier dans lequel se trouvent le bloc système et les lecteurs de disquen. Authentication Header. A form of IP packet authentication included in the IPSec security standard. AH attaches a header to the packet with authentication information but does not encrypt the packet data, which allows its use in cases where encryption is not allowed. See also ESP, IPSec."
    },
    {
      "title": "AI ",
      "description": "n. See artificial intelligence."
    },
    {
      "title": ".aiff ",
      "description": "n. The file extension that identifies audio files in the sound format originally used on Apple and Silicon Graphics (SGI) computers."
    },
    {
      "title": "AIFF ",
      "description": "n. The sound format originally used on Apple and Silicon Graphics (SGI) computers. AIFF stores waveform files in an 8-bit monaural format. See also waveform."
    },
    {
      "title": "AIM ",
      "description": "n. Acronym for America Online Instant Messenger. A popular instant-messaging service provided for free by America Online. With the AIM service, instant messages can be sent over an Internet connection using the AIM software or directly from a Web browser using AIM Express. See also America Online, instant messaging. Compare ICQ, .NET Messenger Service, Yahoo! Messenger."
    },
    {
      "title": "AirPort ",
      "description": "n. A wireless connectivity option introduced by Apple in 1999. AirPort provides wireless network and Internet communications to all AirPort card–equipped Macintosh computers within 150 feet of an AirPort base station. AirPort was developed around the IEEE 802.11 Direct Sequence Spectrum (DSSS) industry standard and is interoperable with other 802.11-based equipment."
    },
    {
      "title": "AirSnort ",
      "description": "n. A hacking tool used to gather and decrypt passwords in data sent over wireless networks. AirSnort monitors wireless transmissions and collects packets of data. When it has collected enough data, AirSnort is able to compute the encryption key used in the transmission. AirSnort takes advantage of security flaws in the Wired Equivalent Protocol (WEP) standard. See also password sniffing."
    },
    {
      "title": "AIX ",
      "description": "n. Acronym for Advanced Interactive Executive. A version of the UNIX operating system developed and maintained by IBM for its UNIX workstations and PCs."
    },
    {
      "title": "alarm ",
      "description": "n. A visual or auditory signal from a computer alerting the user to an error or a hazardous situation."
    },
    {
      "title": "ALB ",
      "description": "n. See load balancing."
    },
    {
      "title": "alert ",
      "description": "n. 1. In many operating systems with GUIs (graphical user interfaces), an audible or visual alarm that signals an error or represents a warning of some sort. See also alert box. 2. In programming, an asynchronous notification sent by one thread to another. The alert interrupts the recipient thread at defined points in its execution and causes it to execute an asynchronous procedure call. See also asynchronous procedure call, thread (definition 1)."
    },
    {
      "title": "alert box ",
      "description": "n. An on-screen box in a GUI (graphical user interface) that is used to deliver a message or warning. Compare dialog box."
    },
    {
      "title": "Alerter service",
      "description": "n. A service used by the server and other services to notify selected users and computers of administrative alerts that occur on a computer. The Alerter service requires the Messenger service. See also administrative alerts, Messenger service, service."
    },
    {
      "title": "ALGOL",
      "description": "n. Acronym for Algorithmic Language. The first structured procedural programming language, developed in the late 1950s and once widely used in Europe."
    },
    {
      "title": "algorithm ",
      "description": "n. A finite sequence of steps for solving a logical or mathematical problem or performing a task."
    },
    {
      "title": "algorithmic language ",
      "description": "n. A programming language, such as Ada, Basic, C, or Pascal, that uses algorithms for problem solving."
    },
    {
      "title": "Algorithmic Language ",
      "description": "n. See ALGOL."
    }, 
    {
      "title": "alias ",
      "description": "n. 1. An alternative label for some object, such as a file or data collection. 2. A name used to direct e-mail messages to a person or group of people on a network. 3. A false signal that results from the digitization of an analog audio sample."
    },
    {
      "title": "aliasing ",
      "description": "n. In computer graphics, the jagged appearance of curves or diagonal lines on a display screen, which is caused by low screen resolution. See the illustration."
    },
    {
      "title": "Aliasing. ",
      "description": "The lower resolution of the image on the right reveals the aliasing effect."
    },
    {
      "title": "aliasing bug ",
      "description": "n. A class of subtle programming errors that can arise in code that performs dynamic allocation. If severaseveral pointers address the same chunk of storage, the program may free the storage using one of the pointers but then attempt to use another one (an alias), which would no longer be pointing to the desired data. This bug is avoidable by the use of allocation strategies that never use more than one copy of a pointer to allocated core memory, or by the use of higher-level languages, such as LISP, which employ a garbage collection feature. Also called: stale pointer bug. See also alias, dynamic allocation, garbage collection."
    },
    {
      "title": "align ",
      "description": "vb. 1. In an application such as a word processor, to position lines of type relative to some point, such as the page margin. The most common types of alignment are left- and right-aligned and centered. See the illustration. 2. To adjust some device to position it within specified tolerances, such as the read/write head relative to a track on a disk. 3. In data handling, to store multiple-byte data units so that the respective bytes fall in corresponding locations of memory."
    },
    {
      "title": "alignment ",
      "description": "n. The arrangement of objects in fixed or predetermined positions, rows, or columns. For example, the Macintosh Finder can do automatic alignment of icons in a folder or on the desktop."
    },
    {
      "title": "Allegro ",
      "description": "n. Ported to a number of operating systems, Allegro is a freeware library of functions for use in programming computer games and graphics programs. It is written for the DJGPP compiler in a mixture of C and assembly language. The most recent release version is 4.0.0. See also assembly language, DJGPP. "
    },
    {
      "title": "allocate ",
      "description": "vb. To reserve a resource, such as sufficient memory, for use by a program. Compare deallocate."
    },
    {
      "title": "allocation ",
      "description": "n. In operating systems, the process of reserving memory for use by a program."
    },
    {
      "title": "allocation block size ",
      "description": "n. The size of an individual block on a storage medium, such as a hard drive, which is determined by factors such as total disk size and partitioning options."
    },
    {
      "title": "allocation unit ",
      "description": "n. See cluster."
    },
    {
      "title": "all points addressable",
      "description": "n. The mode in computer graphics in which all pixels can be individually manipulated. Acronym: APA.See also graphics mode."
    },
    {
      "title": "ALOHA ",
      "description": "n. See ALOHAnet."
    },
    {
      "title": "ALOHAnet ",
      "description": "n. The first wireless packet-switched network and the first large network to be connected to the ARPANET. ALOHAnet was built in 1970 at the University of Hawaii by Norm Abramson and was funded by Larry Roberts. ALOHAnet enabled computers at seven campuses on four different islands to communicate bidirectionally with the central computer on Oahu using a network of radio transmitters. The ALOHA protocol was the basis for Ethernet. See also ARPANET, Ethernet, network."
    },
    {
      "title": "alpha (1) ",
      "description": "adj. Of or pertaining to software that is ready for initial testing."
    },
    {
      "title": "alpha (2)",
      "description": "n. A software product that is under development and has enough functionality to begin testing. An alpha is usually unstable and does not have all the features or functionality that the released product is to have. Compare beta (2)."
    },
    {
      "title": "Alpha ",
      "description": "n. 1. Digital Equipment Corporation’s (DEC) line of computers built on its 64-bit RISC-based microprocessor (Alphachip). 2. DEC’s internal name for a microprocessor product introduced in February 1992 as the DECchip 21064, which evolved into DEC’s current Alphachips. See also Alphachip, DECchip 21064."
    },
    {
      "title": "Alpha AXP ",
      "description": "adj. Of, pertaining to, or characteristic of Digital Equipment Corporation’s 64-bit RISC-based microprocessor technology implemented in its DECchip product. The designation AXP is used by DEC in its personal computer products to indicate that a product has a DECchip microprocessor. See also Alpha, DECchip 21064, RISC."
    },
    {
      "title": "alphabet ",
      "description": "n. In communications and data processing, the subset of a complete character set, including letters, numerals, punctuation marks, and other common symbols as well as the codes used to represent them. See also ASCII, CCITT, character set, EBCDIC, ISO."
    },
    {
      "title": "alpha blending ",
      "description": "n. In 3-D computer game rendering and other digital animation applications, a graphics technique for creating realistic transparent and semi-transparent images. Alpha blending combines a transparent source color with a translucent destination color to realistically simulate effects such as smoke, glass, and water."
    },
    {
      "title": "Alpha box ",
      "description": "n. A computer built around the DEC’s DECchip 21064 processor (called Alpha internally at Digital Equipment Corporation). See also DECchip 21064."
    },
    {
      "title": "alpha channel ",
      "description": "n. The high-order 8 bits of a 32-bit graphics pixel used to manipulate the remaining 24 bits for purposes of coloring or masking."
    },
    {
      "title": "Alphachip ",
      "description": "n. A 64-bit RISC-based microprocessor from Digital Equipment Corporation. See also DECchip 21064, RISC."
    },
    {
      "title": "alphageometric ",
      "description": "adj. In reference to computer graphics, especially videotext and teletext systems, pertaining to or being a display method that uses codes for alphanumeric characters and creates graphics using geometric primitives. Shapes such as horizontal and vertical lines and corners are alphageometric. See also alphamosaic."
    },
    {
      "title": "alphamosaic ",
      "description": "adj. In reference to computer graphics, especially videotext and teletext systems, pertaining to or being a display technique that uses codes for alphanumeric characters and creates graphics using rectangular arrangements of elements to form a mosaic. See also alphageometric."
    },
    {
      "title": "alphanumeric ",
      "description": "adj. Consisting of letters or digits, or both, and sometimes including control characters, space characters, and other special characters. See also ASCII, character set, EBCDIC."
    },
    {
      "title": "alphanumeric display ",
      "description": "n. Electronic display on a wireless phone, pager, or handheld device capable of showing both text and numbers."
    },
    {
      "title": "alphanumeric display terminal ",
      "description": "n. A terminal capable of displaying characters but not graphics."
    },
    {
      "title": "alphanumeric messaging ",
      "description": "n. Ability to receive messages containing text and numbers on a pager or digital wireless phone. Also known as short message service (SMS)."
    },
    {
      "title": "alphanumeric mode ",
      "description": "n. See text mode."
    },
    {
      "title": "alphanumeric sort ",
      "description": "n. A method of sorting data, such as a set of records, that typically uses the following order: punctuation marks, numerals, alphabetic characters (with capitals preceding lowercase letters), and any remaining symbols."
    },
    {
      "title": "alpha test ",
      "description": "n. The process of user testing that is carried out on a piece of alpha software."
    },
    {
      "title": "Altair 8800 ",
      "description": "n. A small computer introduced in 1975 by Micro Instrumentation Telemetry Systems (MITS) of New Mexico and sold primarily in kit form. The Altair was based on the 8-bit Intel 8080 microprocessor, had 256 bytes of random access memory, received input through a bank of switches on the front panel, and displayed output via a row of light-emitting diodes. Although it was shortlived, the Altair is considered the first successful personal computer, which was then called a home computer."
    },
    {
      "title": "AltaVista ",
      "description": "n. A World Wide Web search site and portal hosted by Digital Equipment Corporation. See also portal."
    },
    {
      "title": "alternate circuit-switched voice/circuit-switched data ",
      "description": "n. A configuration option for ISDN B (bearer) channels that enables the digital transmission of either voice or data communications between two users for the duration of a call. Acronym: CSV/CSD.See also B channel, circuit-switched data, circuit-switched voice, ISDN."
    },
    {
      "title": "alternate key ",
      "description": "n. 1. Any candidate key in a database not designated as the primary key. 2. See Alt key."
    },
    {
      "title": "alternating current ",
      "description": "n. Electric current that reverses its direction of flow (polarity) periodically according to a frequency measured in hertz, or cycles per second. Acronym: AC.Compare direct current."
    },
    {
      "title": "Alt key ",
      "description": "n. A key included on PC and other standard keyboards that is used in conjunction with another key to produce some special feature or function and is typically marked with the letters Alt."
    },
    {
      "title": "alt. newsgroups ",
      "description": "n. Internet newsgroups that are part of the alt. (“alternative”) hierarchy and have the prefix alt. Unlike the seven Usenet newsgroup hierarchies (comp., misc., news., rec., sci., soc., talk.) that require formal votes among users in the hierarchy before official newsgroups can be established, anybody can create an alt. newsgroup. Therefore, newsgroups devoted to discussions of obscure or bizarre topics are generally part of the alt. hierarchy."
    },
    {
      "title": "ALU ",
      "description": "n. See arithmetic logic unit."
    },
    {
      "title": "always on ",
      "description": "n. An Internet connection that is maintained continuously, whether or not the computer user is on line. Always-on connections provide convenience to users who don’t need to dial in or log on to access the Internet, but also provide more opportunities for hackers to attempt to access the system or use the computer to spread malicious programs."
    },
    {
      "title": "AM ",
      "description": "n. See amplitude modulation."
    },
    {
      "title": "AMD-K6 ",
      "description": "n. Family of x86-compatible processors introduced by Advanced Micro Devices, Inc. (AMD) in 1997. Comparable in performance to the Intel Pentium II, the AMD-K6 family is composed of Windows-compatible processors with MMX support that run 32-bit programs. They have 8.8 million transistors, include 64-KB (AMDK6) L1 caches for faster execution, and are based on a technology known as RISC86 that converts x86 program instructions into RISC operations for execution. The AMD-K6 family ranges in speed from 166 to over 500 MHz. See also MMX, Pentium, RISC."
    },
    {
      "title": "AMD-K7 ",
      "description": "n. See Athlon."
    },
    {
      "title": "American Federation of Information Processing Societies",
      "description": "n. See AFIPS."
    },
    {
      "title": "American National Standards Institute ",
      "description": "n. See ANSI."
    },
    {
      "title": "American Registry for Internet Numbers ",
      "description": "n. See ARIN."
    },
    {
      "title": "American Standard Code for Information Interchange ",
      "description": "n. See ASCII."
    },
    {
      "title": "America Online ",
      "description": "n. An online information service, based in Vienna, Virginia, that provides e-mail, news, educational and entertainment services, and Internet access. America Online is one of the largest American ISPs (Internet service providers). In 2000 America Online merged with media giant Time Warner Inc. to become AOL Time Warner Inc. Intended for mass-market delivery of branded content and communication services, the merged companies form a communication and media conglomerate with the Internet’s largest user base and a wide range of entertainment, publishing, and cable properties. Acronym: AOL."
    },
    {
      "title": "America Online Instant Messenger ",
      "description": "n. See AIM."
    },
    {
      "title": "AMI BIOS ",
      "description": "n. A ROM BIOS developed and marketed by American Megatrends, Inc. (AMI), for use in IBM-compatible computers. A popular feature is that its configuration software is stored in the ROM chip along with the BIOS routines, so the user does not need a separate configuration disk to modify system settings, such as amount of memory installed and number and types of disk drives. See also BIOS, Phoenix BIOS, ROM BIOS. "
    },
    {
      "title": "Amiga ",
      "description": "n. An operating system owned by Amiga, Inc. The Amiga model of desktop computer, which featured the Amiga operating system, was introduced by Commodore in 1985. The Amiga was especially strong in its ability to support sound and video, which made it popular among broadcast and multimedia producers, but it was overshadowed by the IBM Personal Computer (and its clones) and the Apple Macintosh. The ownership of the Amiga design has been through the hands of several companies in the United States and Germany."
    },
    {
      "title": "amp ",
      "description": "n. See ampere."
    },
    {
      "title": "ampere ",
      "description": "n. The basic unit of electric current. One ampere is equivalent to a flow of 1 coulomb per second. Abbreviation: a, A, amp."
    },
    {
      "title": "amplitude ",
      "description": "n. A measure of the strength of a signal, such as sound or voltage, determined by the distance from the baseline to the peak of the waveform. See also waveform."
    },
    {
      "title": "amplitude modulation ",
      "description": "n. A method of encoding information in a transmission, such as radio, using a carrier wave of constant frequency but of varying amplitude. See the illustration. Acronym: AM.Compare frequency modulation."
    },
    {
      "title": "amplitude shift keying ",
      "description": "n. A form of amplitude modulation that uses two different wave heights to represent the binary values 1 and 0. See also amplitude modulation."
    },
    {
      "title": "AMPS ",
      "description": "n. Acronym for Advanced Mobile Phone Service. The standard for analog cellular phone service, widely used in the United States and many other countries around the world. AMPS was introduced by AT&T in 1983. It relies on frequency division multiple access (FDMA) to divide frequencies in the 800 MHz to 900 MHz range into 30 KHz channels for sending and receiving calls. A form of AMPS based on a narrower bandwidth is known as N-AMPS. The comparable standard for digital cellular phones is known as D-AMPS. See also D-AMPS, N-AMPS."
    },
    {
      "title": "AMPS/D-AMPS/N-AMPS ",
      "description": "n. See AMPS, D-AMPS, N-AMPS."
    },
    {
      "title": "AMT ",
      "description": "n. See address mapping table."
    },
    {
      "title": "Anaglyph ",
      "description": "n. A 3-D effect obtained by creating two overlapping images that appear as a single three dimensional image when viewed through special lenses. Anaglyph 3-D technologies are used on the Web to produce 3-D images for a variety of virtual reality, teaching, and research applications."
    },
    {
      "title": "analog ",
      "description": "adj. Pertaining to or being a device or signal that is continuously varying in strength or quantity, such as voltage or audio, rather than based on discrete units, such as the binary digits 1 and 0. A lighting dimmer switch is an analog device because it is not based on absolute settings. Compare digital (definition 2)."
    },
    {
      "title": "analog channel ",
      "description": "n. A communications channel, such as a voice-grade telephone line, carrying signals that vary continuously and can assume any value within a specified range."
    },
    {
      "title": "analog computer ",
      "description": "n. A computer that measures data varying continuously in value, such as speed or temperature."
    },
    {
      "title": "analog data ",
      "description": "n. Data that is represented by continuous variations in some physical property, such as voltage, frequency, or pressure. Compare digital data transmission."
    },
    {
      "title": "analog display ",
      "description": "n. A video display capable of depicting a continuous range of colors or shades rather than discrete values. Compare digital display."
    },
    {
      "title": "analog line ",
      "description": "n. A communications line, such as a standard telephone line, that carries continuously varying (analog) signals."
    },
    {
      "title": "analog modem ",
      "description": "n. See modem."
    },
    {
      "title": "analog signal generator ",
      "description": "n. A device that generates continuously variable signals and is sometimes used to activate an actuator in a disk drive. See also actuator."
    },
    {
      "title": "analog-to-digital converter ",
      "description": "n. A device that converts a continuously varying (analog) signal, such as sound or voltage, from a monitoring instrument to binary code for use by a computer. See the illustration. Acronym: ADC.Also called: A-D converter. See also modem. Compare digital-to-analog converter."
    },
    {
      "title": "analysis ",
      "description": "n. The evaluation of a situation or problem, including review from various aspects or points of view. In computing, analysis commonly involves such features as flow control, error control, and evaluation of efficiency. Often the overall problem is divided into smaller components that can be more easily dealt with. See also flow analysis, numerical analysis, systems analysis. Compare synthesis."
    },
    {
      "title": "analysis graphics ",
      "description": "n. See presentation graphics."
    },
    {
      "title": "Analytical Engine ",
      "description": "n. A mechanical calculating machine designed by British mathematician Charles Babbage in 1833 but never completed. It was the first general-purpose digital computer. See also Difference Engine."
    },
    {
      "title": "anchor ",
      "description": "n. 1. A format code in a desktop publishing or word processing document that keeps an element in the document, such as a figure or a caption or a label associated with the figure, in a certain position in the document. The anchored object is generally attached to another element in the document such as a piece of text (often a paragraph), a graphic, or a particular place in the document. As text and other objects are added to the document, the anchored object moves relative to the object to which it is anchored or remains stationary. 2. A tag in an HTML document that defines a section of text, an icon, or other element as a link to another element in the document or to another document or file. See also hyperlink."
    },
    {
      "title": "ancillary equipment ",
      "description": "n. See peripheral."
    },
    {
      "title": "AND ",
      "description": "n. A logical operation combining the values of two bits (0, 1) or two Boolean values (false, true) that returns a value of 1 (true) if both input values are 1 (true) and returns a 0 (false) otherwise."
    },
    {
      "title": "AND gate ",
      "description": "n. A digital circuit whose output is a value of 1 only when all input values are 1. See the illustration. See also truth table."
    },
    {
      "title": "Andrew File System ",
      "description": "n. See AFS."
    },
    {
      "title": "angle bracket ",
      "description": "n. See <>."
    },
    {
      "title": "angstrom ",
      "description": "n. A unit of measure equal to one 10-billionth (10exp–10) of a meter or one 250-millionth of an inch. Light wavelength, for example, is commonly measured in angstroms. Abbreviation: Å."
    },
    {
      "title": "animated cursors ",
      "description": "n. A Windows 95 and Windows NT feature that allows a series of frames, one after another, to appear at the mouse pointer location instead of a single image, thus producing a short loop of animation. The animated cursors feature is designated by the .ani suffix."
    },
    {
      "title": "animated GIF ",
      "description": "n. A series of graphic images in GIF format, displayed sequentially in a single location to give the appearance of a moving picture. See also GIF."
    },
    {
      "title": "animation ",
      "description": "n. The illusion of movement created by using a succession of static images. In computer graphics, the images can all be drawn separately, or starting and ending points can be drawn with the intervening images provided by software. See also 3-D graphic, surface modeling, tween, wire-frame model."
    },
    {
      "title": "ANN ",
      "description": "n. See artificial neural network."
    },
    {
      "title": "annotation ",
      "description": "n. A note or comment attached to some part of a document to provide related information. Some applications support voice annotations or annotations accessible by icons. See also comment."
    },
    {
      "title": "annoybot ",
      "description": "n. A bot on an Internet Relay Chat (IRC) channel or a multiuser dungeon (MUD) that interacts with the user in an obnoxious manner. See also bot, IRC, MUD."
    },
    {
      "title": "anode ",
      "description": "n. In electronics, the positively charged terminal or electrode toward which electrons flow. Compare cathode."
    },
    {
      "title": "anonymity ",
      "description": "n. The ability to send an e-mail message or an article to a newsgroup without one’s identity becoming known. Ordinarily, the e-mail address of the sender appears automatically in a message’s header, which is created by the client software. To achieve anonymity, a message must be sent through an anonymous remailer which, however, maintains a record of the sender’s identity to enable replies. See also anonymous remailer."
    },
    {
      "title": "anonymous ",
      "description": "n. On the Internet, the standard login name used to obtain access to a public FTP file archive. See also anonymous FTP."
    },
    {
      "title": "anonymous FTP ",
      "description": "n. The ability to access a remote computer system on which one does not have an account, via the Internet’s File Transfer Protocol (FTP). Users have restricted access rights with anonymous FTP and usually can only copy files to or from a public directory, often named /pub, on the remote system. Users can also typically use FTP commands, such as listing files and directories. When using anonymous FTP, the user accesses the remote computer system with an FTP program and generally uses anonymous or ftp as a logon name. The password is usually the user’s e-mail address, although a user can often skip giving a password or give a false e-mail address. In other cases, the password can be the word anonymous. Many FTP sites do not permit anonymous FTP access in order to maintain security. Those that do permit anonymous FTP sometimes restrict users to only downloading files for the same reason. See also FTP1 (definition 1), logon, /pub."
    },
    {
      "title": "anonymous post ",
      "description": "n. A message in a newsgroup or mailing list that cannot be traced to its originator. Generally this is accomplished by using an anonymous server for newsgroup posts or an anonymous remailer for e-mail. See also anonymous remailer."
    },
    {
      "title": "anonymous remailer ",
      "description": "n. An e-mail server that receives incoming messages, replaces the headers that identify the original sources of the messages, and sends the messages to their ultimate destinations. The purpose of an anonymous remailer is to hide the identities of the senders of the e-mail messages."
    },
    {
      "title": "anonymous server ",
      "description": "n. 1. The software used by an anonymous remailer. See also anonymous remailer. 2. Software that provides anonymous FTP service. See also anonymous FTP."
    },
    {
      "title": "ANSI ",
      "description": "n. 1. Acronym for American National Standards Institute. A voluntary, nonprofit organization of business and industry groups formed in 1918 for the development and adoption of trade and communication standards in the United States. ANSI is the American representative of ISO (the International Organization for Standardization). Among its many concerns, ANSI has developed recommendations for the use of programming languages including FORTRAN, C, and COBOL, and various networking technologies. See also ANSI C, ANSI.SYS, SCSI. 2. The Microsoft Windows ANSI character set. This set is includes ISO 8859/x plus additional characters. This set was originally based on an ANSI draft standard. The MSDOS operating system uses the ANSI character set if ANSI.SYS is installed."
    },
    {
      "title": "ANSI C ",
      "description": "n. A version of the C programming language standardized by ANSI. See also ANSI, K&R C."
    },
    {
      "title": "ANSI/SPARC ",
      "description": "n. Acronym for American National Standards Institute Standards Planning and Requirements Committee. The ANSI committee that, in the 1970s, proposed a generalized, three-schema architecture that is used as the foundation for some database management systems."
    },
    {
      "title": "ANSI.SYS ",
      "description": "n. An installable device driver for MS-DOS computers that uses ANSI commands (escape sequences) to enhance the user’s control of the console. See also ANSI, driver, escape sequence, install."
    },
    {
      "title": "ANSI X3.30-1997 ",
      "description": "n. A standard entitled “Representation for Calendar Date and Ordinal Date for Information Interchange” from the American National Standards Institute (ANSI) that covers date formats. Many organizations, including the U.S. federal government, have standardized date formats using this standard to facilitate work on the Year 2000 problem."
    },
    {
      "title": "answer mode ",
      "description": "n. A setting that allows a modem to answer an incoming call automatically. It is used in all fax machines. Also called: auto answer."
    },
    {
      "title": "answer-only modem ",
      "description": "n. A modem that can receive but not originate calls."
    },
    {
      "title": "answer/originate modem ",
      "description": "n. A modem that can both send and receive calls—the most common type of modem in use."
    },
    {
      "title": "antialiasing ",
      "description": "n. A software technique for smoothing the jagged appearance of curved or diagonal lines caused by poor resolution on a display screen. Methods of anti-aliasing include surrounding pixels with intermediate shades and manipulating the size and horizontal alignment of pixels. See the illustration. See also dithering. Compare aliasing."
    },
    {
      "title": "antiglare or anti-glare ",
      "description": "adj. Pertaining to any measure taken to reduce reflections of external light on a monitor screen. The screen may be coated with a chemical (which may reduce its brightness), covered with a polarizing filter, or simply rotated so that external light is not reflected into the user’s eye."
    },
    {
      "title": "anti-replay ",
      "description": "n. An IP packet–level security feature that prevents packets that have been intercepted and changed from being inserted into the data stream. Anti-replay creates a security association between a source and destination computer, with each agreeing on a numbering sequence for transmitted packets. The anti-replay mechanism detects packets tagged with numbers that fall outside the accepted sequence, discards them, sends an error message, and logs the event. The anti-replay protocol is included as part of the IPSec standard. See also IPSec."
    },
    {
      "title": "antistatic device ",
      "description": "n. A device designed to minimize shocks caused by the buildup of static electricity, which can disrupt computer equipment or cause data loss. An antistatic device may take the form of a floor mat, a wristband with a wire attached to the workstation, a spray, a lotion, or other special-purpose device. See also static (2), static electricity."
    },
    {
      "title": "antivirus program ",
      "description": "n. A computer program that scans a computer’s memory and mass storage to identify, isolate, and eliminate viruses, and that examines incoming files for viruses as the computer receives them."
    },
    {
      "title": "anti-worm ",
      "description": "n. See automatic patching, do-gooder virus."
    },
    {
      "title": "anycasting ",
      "description": "n. Communication between a single sender and the nearest receiver in a group. In IPv6, anycasting enables one host to initiate the updating of routing tables for a group of hosts. See also IPv6. Compare multicasting, unicast."
    },
    {
      "title": "any key ",
      "description": "n. Any random key on a computer keyboard. Some programs prompt the user to “press any key” to continue. It does not matter which key the user presses. There is no key on the keyboard called Any."
    },
    {
      "title": "any-to-any connectivity ",
      "description": "n. The property of an integrated computer network environment where it is possible to share data across multiple protocols, host types, and network topologies."
    },
    {
      "title": "AOL ",
      "description": "n. See America Online."
    },
    {
      "title": "AOL Instant Messenger ",
      "description": "n. See AIM."
    },
    {
      "title": "AOL NetFind ",
      "description": "n. Resident Web-finding tool of America Online (AOL) information service. Searches by keyword and concept. Using Intelligent Concept Extraction (ICE) and Excite technology, this tool finds relationships between words and ideas; for example, between “elderly people” and “senior citizen.” See also Excite, Intelligent Concept Extraction."
    },
    {
      "title": "APA ",
      "description": "n. See all points addressable."
    },
    {
      "title": "Apache ",
      "description": "n. A free open-source HTTP (Web) server introduced in 1995 by the Apache Group as an extension to, and improvement of, the National Center for Supercomputing Applications’ earlier HTTPd (version 1.3). Apache is popular on UNIX-based systems, including Linux, and also runs on Windows NT and other operating systems, such as BeOS. Because the server was based on existing code with a series of patches, it became known as “A Patchy server,” which led to the official name Apache. See also HTTPd."
    },
    {
      "title": "Apache Group ",
      "description": "n. A non-profit organization of volunteers from around the world that operates and contributes to the Apache HTTP Server Project."
    },
    {
      "title": "Apache HTTP Server Project ",
      "description": "n. A collaborative effort by the members of the Apache Group to design, develop, and maintain the Apache HTTP (Web) server. See also Apache, Apache Group."
    },
    {
      "title": "Apache project ",
      "description": "n. See Apache HTTP Server Project."
    },
    {
      "title": "APC ",
      "description": "n. See asynchronous procedure call."
    },
    {
      "title": "aperture grill ",
      "description": "n. A type of CRT (cathode ray tube) used in computer monitors that uses thin, closely-spaced vertical wires to isolate the individual pixels. The first aperture grill CRT was the Sony Trinitron, but several other manufacturers also produce aperture grill CRTs. See also CRT."
    },
    {
      "title": "APEX ",
      "description": "n. Acronym for Assembly Process Exhibition and Conference. Exhibition and conference for members of the electronics manufacturing industry. APEX features product exhibits, speeches, technical conferences, and forums on issues that affect the industry."
    },
    {
      "title": "API ",
      "description": "n. See application programming interface."
    },
    {
      "title": "APL ",
      "description": "n. Acronym for A Programming Language. A high-level language introduced in 1968 for scientific and mathematical applications. APL is a subprogram-based interpreted language that uses a large set of special characters and terse syntax and is available for use on PC-compatible machines. See also interpreted language."
    },
    {
      "title": "APM ",
      "description": "n. See Advanced Power Management."
    },
    {
      "title": "APNIC ",
      "description": "n. Acronym for Asian-Pacific Network Information Center, a nonprofit, voluntary membership organization covering the Asia/Pacific Rim region. APNIC, like its European counterpart RIPE and its American counterpart ARIN, devotes itself to matters related to the Internet, among them such tasks as registering new members, allocating IP addresses, and maintaining database information. See also ARIN, RIPE."
    },
    {
      "title": "app ",
      "description": "n. See application."
    },
    {
      "title": "APPC ",
      "description": "n. Acronym for Advanced Program-to-Program Communication. A specification developed as part of IBM’s SNA (Systems Network Architecture) model and designed to enable applications programs running on different computers to communicate and exchange data directly. APPC extends SNA to include minicomputers and PCs."
    },
    {
      "title": "append ",
      "description": "vb. To place or insert as an attachment by adding data to the end of a file or database or extending a character string. See also file, string. Compare truncate."
    },
    {
      "title": "Apple II ",
      "description": "n. The second computer introduced by the Apple Computer Corporation, in April 1977. The Apple II featured 4 K dynamic RAM, expandable to 48 K (with 16 K chips), and used the 6502 microprocessor. The Apple II was the first computer to offer a TV video adapter as an optional alternative to a color computer monitor. It also featured sound and eight expansion slots. See also 6502."
    },
    {
      "title": "Apple Desktop Bus ",
      "description": "n. A serial communications pathway built into Apple Macintosh and Apple IIGS computers. Typically a flexible cord, it enables low-speed input devices, such as a keyboard or mouse, to communicate with the computer. The bus functions like a simple local area network that can connect up to 16 devices, such as light pens, trackballs, and graphics tablets, to the computer. Although there are only two external ports, more than two devices can be linked in a series called a daisy chain. Acronym: ADB.See also bus, daisy chain (2), device driver, input/output port, serial communication."
    },
    {
      "title": "AppleDraw ",
      "description": "n. A shareware drawing application for Macintosh computers."
    },
    {
      "title": "Apple Events ",
      "description": "n. A feature added to Mac OS System 7 that enables one application to send a command, such as save or open, to another application. See also Mac OS."
    },
    {
      "title": "Apple Extended Keyboard ",
      "description": "n. A 105-key keyboard that works with the Macintosh SE, Macintosh II, and Apple IIGS computers. This keyboard marks Apple’s first inclusion of function (F) keys, whose absence was long cited as a shortcoming of the Macintosh compared with IBM PCs and compatibles. This feature, along with other layout changes and the addition of new keys and lights, makes the Apple Extended Keyboard quite similar in form to the IBM enhanced keyboard. See the illustration. See also enhanced keyboard."
    },
    {
      "title": "Apple Filing Protocol ",
      "description": "n. See AFP."
    },
    {
      "title": "Apple key ",
      "description": "n. A key on Apple keyboards labeled with an outline of the Apple logo. On the Apple Extended Keyboard, this key is the same as the Command key, which functions similarly to the Control key on IBM and compatible keyboards. It is generally used in conjunction with a character key as a shortcut to making menu selections or starting a macro."
    },
    {
      "title": "Apple Macintosh ",
      "description": "n. See Macintosh."
    },
    {
      "title": "Apple Newton ",
      "description": "n. See Newton."
    },
    {
      "title": "AppleScript ",
      "description": "n. A script language developed by Apple Computer, Inc., for Macintosh computers running under the Mac OS to execute commands and automate functions. See also script."
    },
    {
      "title": "AppleShare ",
      "description": "n. A file server software developed by Apple Computer, Inc., that works with the Mac OS and allows one Macintosh computer to share files with another on the same network. See also file server, Mac OS."
    },
    {
      "title": "applet ",
      "description": "n. A program that can be downloaded over the Internet and executed on the recipient’s machine. Applets are often written in the Java programming language and run within browser software, and they are typically used to customize or add interactive elements to a Web page."
    },
    {
      "title": "AppleTalk ",
      "description": "n. An inexpensive local area network developed by Apple Computer, Inc., for Macintosh computers that can be used by Apple and non-Apple computers to communicate and share resources such as printers and file servers. Non-Apple computers must be equipped with AppleTalk hardware and suitable software. The networkn. An inexpensive local area network developed by Apple Computer, Inc., for Macintosh computers that can be used by Apple and non-Apple computers to communicate and share resources such as printers and file servers. Non-Apple computers must be equipped with AppleTalk hardware and suitable software. The network uses a layered set of protocols similar to the ISO/OSI reference model and transfers information in the form of packets called frames. AppleTalk supports connections to other AppleTalk networks through devices known as bridges, and it supports connections to dissimilar networks through devices called gateways. See also bridge, frame (definition 2), gateway."
    },
    {
      "title": "AppleTalk Phase 2",
      "description": "n. The extended AppleTalk Internet model designed by Apple Computer, Inc., that supports multiple zones within a network and extended addressing capacity."
    },
    {
      "title": "AppleWorks ",
      "description": "n. A suite of productivity applications, formerly known as ClarisWorks, distributed by Apple Computer, Inc., and shipped on the iMac computer. AppleWorks/ ClarisWorks is an integrated product that includes support for word processing, spreadsheets, databases, drawing, painting, charting, and the Internet."
    },
    {
      "title": "appliance ",
      "description": "n. 1. See server appliance. 2. See information appliance. 3. A device with a single or limited purpose with functionality. This functionality is similar to a simple consumer appliance."
    },
    {
      "title": "appliance server ",
      "description": "n. 1. An inexpensive computing device used for specific tasks including Internet connectivity or file-and-print services. The server is usually easy to use but does not possess the capabilities or software of a typical server for general office use. 2. See server appliance."
    },
    {
      "title": "application ",
      "description": "n. A program designed to assist in the performance of a specific task, such as word processing, accounting, or inventory management. Compare utility."
    },
    {
      "title": "application binary interface ",
      "description": "n. A set of instructions that specifies how an executable file interacts with the hardware and how information is stored. Acronym: ABI.Compare application programming interface."
    },
    {
      "title": "application-centric ",
      "description": "adj. Of, pertaining to, or characteristic of an operating system in which a user invokes an application to open or create documents (such as word processing files or spreadsheets). Command-line interfaces and some graphical user interfaces such as the Windows 3.x Program Manager are application-centric. Compare document-centric."
    },
    {
      "title": "application developer ",
      "description": "n. An individual who designs and analyzes the appearance and operation of an application program."
    },
    {
      "title": "application development environment ",
      "description": "n. An integrated suite of programs for use by software developers. Typical components of application development environments include a compiler, file browsing system, debugger, and text editor for use in creating programs."
    },
    {
      "title": "application development language ",
      "description": "n. A computer language designed for creating applications. The term is usually restricted to refer to languages with specific highlevel constructs geared toward record design, form layout, database retrieval and update, and similar tasks. See also 4GL, application, application generator."
    },
    {
      "title": "application development system ",
      "description": "n. A programming environment designed for the development of an application, typically including a text editor, compiler, and linker, and often including a library of common software routines for use in the developed program."
    },
    {
      "title": "application entity ",
      "description": "n. See AE."
    },
    {
      "title": "application file ",
      "description": "n. See program file."
    },
    {
      "title": "Application Foundation Classes ",
      "description": "n. A set of Java class libraries developed by Microsoft that provides developers with user-interface controls and graphics tools for creating and manipulating elements such as text and fonts. The Application Foundation Classes extend the capabilities of Java’s Abstract Windowing Toolkit (AWT) and are used to facilitate and expedite the creation of Java applets and applications through the use of prebuilt, customizable development components. Acronym: AFC.See also Internet Foundation Classes, Java, Java Foundation Classes, Microsoft Foundation Classes."
    },
    {
      "title": "application gateway ",
      "description": "n. Software running on a machine that is intended to maintain security on a secluded network yet allow certain traffic to go between the private network and the outside world. See also firewall."
    },
    {
      "title": "application generator ",
      "description": "n. Software for generating source or machine code for running an application based on a description of the desired functionality. Limited in scope, application generators are included with some database programs and use built-in instruction sets to generate program code. See also application."
    },
    {
      "title": "application heap ",
      "description": "n. A block of RAM used by an application to store its code, resources, records, document data, and other information. See also heap (definition 1), RAM."
    },
    {
      "title": "application layer ",
      "description": "n. The highest layer of standards in the Open Systems Interconnection (OSI) reference model. The application layer contains signals that perform useful work for the user, such as file transfer or remote access to a computer, as opposed to lower levels, which control the exchange of data between transmitter and receiver. See the illustration. See also ISO/OSI reference model."
    },
    {
      "title": "application notification ",
      "description": "n. An application notification starts an application at a specified time or when a system event occurs. When an application starts as the result of a notification, the system specifies a command-line parameter that identifies the event that has occurred. See also Class A IP address, Class B IP address, Class C IP address."
    },
    {
      "title": "application processor ",
      "description": "n. A processor dedicated to a single application."
    },
    {
      "title": "application program ",
      "description": "n. See application."
    },
    {
      "title": "application program interface. ",
      "description": "n. See application programming interface."
    },
    {
      "title": "application programming interface ",
      "description": "n. A set of routines used by an application program to direct the performance of procedures by the computer’s operating system. Acronym: API.Also called: application program interface."
    },
    {
      "title": "application server ",
      "description": "n. 1. A server program on a computer in a distributed network that handles the business logic between users and backend business applications or databases. Application servers also can provide transaction management, failover, and load balancing. An application server is often viewed as part of a three-tier application consisting of a front-end GUI server such as an HTTP server (first tier), an application server (middle tier), and a backend database and transaction server (third tier). Also called: appserver. Compare HTTP server (definition 1). 2. Any machine on which an application-server program is running. Also called: appserver."
    },
    {
      "title": "application service provider ",
      "description": "n. A third-party company or organization that hosts applications or services for individuals or business customers. The customer connects to a data center maintained by the application service provider (ASP) through Internet or private lines to access applications that would otherwise need to be housed on the customer’s local servers or individual PCs. This arrangement allows the customer to free up disk space that would otherwise be taken by applications, as well as to access the most recent software updates. ASPs deliver solutions ranging from high-end applications to services for small and medium-sized businesses. Acronym: ASP."
    },
    {
      "title": "application shortcut key ",
      "description": "n. A key or combination of keys that when pressed will quickly perform an action within an application that would normally require several user actions, such as menu selections. Also called: keyboard shortcut."
    },
    {
      "title": "application software ",
      "description": "n. See application. "
    },
    {
      "title": "application-specific integrated circuit ",
      "description": "n. See gate array."
    },
    {
      "title": "application suite ",
      "description": "n. See suite (definition 1)."
    },
    {
      "title": "appserver ",
      "description": "n. See application server."
    },
    {
      "title": "Aqua ",
      "description": "n. The graphical user interface (GUI) of Macintosh OS X. Aqua was designed to maintain familiarity and a comfort level for users of the earlier Macintosh system while allowing access to newer Macintosh OS X capabilities. The Aqua GUI features updated versions of Macintosh staples such as the Finder alongside new features like the Dock, a new type of organizational tool. See also Dock, Macintosh OS X."
    },
    {
      "title": "arbitration ",
      "description": "n. A set of rules for resolving competing demands for a machine resource by multiple users or processes. See also contention."
    },
    {
      "title": ".arc ",
      "description": "n. The file extension that identifies compressed archive files encoded using the Advanced RISC Computing Specification (ARC) format. See also compressed file."
    },
    {
      "title": "arcade game ",
      "description": "n. 1. A coin-operated computer game for one or more players that features high-quality screen graphics, sound, and rapid action. 2. Any computer game designed to mimic the style of a coin-operated arcade game, such as games marketed for the home computer. See also computer game."
    },
    {
      "title": "Archie ",
      "description": "n. An Internet utility for finding files in public archives obtainable by anonymous FTP. The master Archie server at McGill University in Montreal downloads FTP indexes from participating FTP servers, merges them into a master list, and sends updated copies of the master list to other Archie servers each day. Archie is a shortened form of archive. See also anonymous FTP, FTP1 (definition 1). Compare Jughead, Veronica."
    },
    {
      "title": "Archie client ",
      "description": "n. See Archie. "
    },
    {
      "title": "Archie server ",
      "description": "n. On the Internet, a server that contains Archie indexes to the names and addresses of files in public FTP archives. See also Archie, FTP1 (definition 1), server (definition 2)."
    },
    {
      "title": "architecture ",
      "description": "n. 1. The physical construction or design of a computer system and its components. See also cache, CISC, closed architecture, network architecture, open architecture, pipelining, RISC. 2. The data-handling capacity of a microprocessor. 3. The design of application software incorporating protocols and the means for expansion and interfacing with other programs."
    },
    {
      "title": "archive (1) ",
      "description": "n. 1. A tape or disk containing files copied from another storage device and used as backup storage. 2. A compressed file. 3. A file directory on the Internet that is available by File Transfer Protocol (FTP) or an Internet directory established for dissemination of stored files."
    },
    {
      "title": "archive (2) ",
      "description": "vb. 1. To copy files onto a tape or disk for long-term storage. 2. To compress a file."
    },
    {
      "title": "archive bit ",
      "description": "n. A bit that is associated with a file and is used to indicate whether the file has been backed up. See also back up, bit."
    },
    {
      "title": "archive file ",
      "description": "n. A file that contains a set of files, such as a program with its documentation and example input files, or collected postings from a newsgroup. On UNIX systems, archive files can be created using the tar program; they can then be compressed using compress or gzip. PKZIP under MS-DOS and Windows and StuffIt under Mac OS create archive files that are already compressed. See also compress1, gzip, PKZIP, StuffIt, tar (1)."
    },
    {
      "title": "archive site ",
      "description": "n. A site on the Internet that stores files. The files are usually accessed through one of the following ways: downloaded through anonymous FTP, retrieved through Gopher, or viewed on the World Wide Web. See also anonymous FTP, Gopher."
    },
    {
      "title": "ARCnet ",
      "description": "n. Short for Attached Resource Computer Network. A form of token bus network architecture for PCbased LANs developed by Datapoint Corporation. ARCnet relies on a bus or star topology and can support up to 255 nodes. Different versions run at speeds of 1.5 Mbps, 20 Mbps (ARCnet Plus), and 100 Mbps."
    },
    {
      "title": "ARCnet Plus ",
      "description": "n. See ARCnet."
    },
    {
      "title": "area chart ",
      "description": "n. A graphical presentation, such as of quarterly sales figures, that uses shading or coloring to emphasize the difference between the line representing one set of data points and the line representing a separate but related set of data points. See the illustration."
    },
    {
      "title": "area search ",
      "description": "n. In information management, the examination of a group of documents for the purpose of identifying those that are relevant to a particular subject or category."
    },
    {
      "title": "arg ",
      "description": "n. See argument."
    },
    {
      "title": "argument ",
      "description": "n. An independent variable, used with an operator or passed to a subprogram that uses the argument to carry out specific operations. See also algorithm, operator (definition 1), parameter, subprogram."
    },
    {
      "title": "ARIN ",
      "description": "n. Acronym for American Registry for Internet Numbers. A nonprofit organization formed to register and administer Internet Protocol (IP) addresses in North and South America. The American Registry for Internet Numbers separates the allocation of IP addresses from the administration of top-level Internet domains, such as .com and .edu. Both of these tasks were previously managed by Network Solutions, Inc., as part of the InterNIC consortium. Its international counterparts are RIPE, in Europe, and APNIC, in Asia and the Pacific Rim. See also APNIC, InterNIC, IP address, RIPE."
    },
    {
      "title": "arithmetic (1)",
      "description": "adj. Pertaining to the mathematical operations of addition, subtraction, multiplication, and division."
    },
    {
      "title": "arithmetic (2)",
      "description": "n. The branch of mathematics dealing with the addition, subtraction, multiplication, and division of real numbers."
    },
    {
      "title": "arithmetic expression ",
      "description": "n. A series of elements, including data labels and constants as well as numbers, that are joined by arithmetic operators, such as + and –, and can be calculated to produce a value."
    },
    {
      "title": "arithmetic logic unit ",
      "description": "n. A component of a microprocessor chip used for arithmetic, comparative, and logical functions. Acronym: ALU.See also gate (definition 1)."
    },
    {
      "title": "arithmetic operation ",
      "description": "n. Any of the standard calculations performed in arithmetic—addition, subtraction, multiplication, or division. The term is also used in reference to negative numbers and absolute values."
    },
    {
      "title": "arithmetic operator ",
      "description": "n. An operator that performs an arithmetic operation: +, –,*, or /. An arithmetic operator usually takes one or two arguments. See also argument, binary (1), logical operator, operator (definition 1), unary."
    },
    {
      "title": ".arj ",
      "description": "n. The MS-DOS file extension used with archive files created with the ARJ compression program."
    },
    {
      "title": "ARM ",
      "description": "n. Short for Advanced RISC Machines. A name for any of a group of small, high-performance 32-bit RISCbased microprocessors licensed to various semiconductor manufacturers by designer ARM Limited. ARM chips are notable for their low cost and efficient use of power. They are used in a wide variety of products, including mobile phones, handheld computers, automotive and embedded solutions, and consumer electronics, including digital cameras and game systems. See also StrongARM."
    },
    {
      "title": "ARP ",
      "description": "n. Acronym for Address Resolution Protocol. A TCP/IP protocol for determining the hardware address (or physical address) of a node on a local area network connected to the Internet, when only the IP address (or logical address) is known. An ARP request is sent to the network, and the node that has the IP address responds with its hardware address. Although ARP technically refers only to finding the hardware address, and RARP (for Reverse ARP) refers to the reverse procedure, ARP is commonly used for both senses. See also IP address, TCP/IP."
    },
    {
      "title": "ARPANET ",
      "description": "n. A large wide area network created in the 1960s by the U.S. Department of Defense Advanced Research Projects Agency (ARPA, renamed DARPA in the 1970s) for the free exchange of information between universities and research organizations, although the military also used this network for communications. In the 1980s MILNET, a separate network, was spun off from ARPANET for use by the military. ARPANET was the network from which the Internet evolved. See also ALOHAnet, Internet, MILNET."
    },
    {
      "title": "ARP request ",
      "description": "n. Short for Address Resolution Protocol request. An ARP packet containing the Internet address of a host computer. The receiving computer responds with or passes along the corresponding Ethernet address. See also ARP, Ethernet, IP address, packet."
    },
    {
      "title": "array ",
      "description": "n. In programming, a list of data values, all of the same type, any element of which can be referenced by an expression consisting of the array name followed by an indexing expression. Arrays are part of the fundamentals of data structures, which, in turn, are a major fundamental of computer programming. See also array element, index (1), record (1), vector."
    },
    {
      "title": "array element ",
      "description": "n. A data value in an array."
    },
    {
      "title": "array processor ",
      "description": "n. A group of interconnected, identical processors operating synchronously, often under the control of a central processor."
    },
    {
      "title": "arrow key ",
      "description": "n. Any of four keys labeled with arrows pointing up, down, left, and right, used to move the cursor vertically or horizontally on the display screen or, in some programs, to extend the highlight. See the illustration."
    },
    {
      "title": "ART ",
      "description": "n. Acronym for Adaptive Resonance Theory. First introduced as a theory of human information processing by Stephen Grossberg, ART has evolved into several classes of self-organizing neural networks that use two layers of ideal cases to predict outcome. It is a form of cluster analysis where data is classified or matched to the previously stored pattern it most closely resembles. This data is said to resonate with the ideal case layer, which is then updated to reflect the new information. The constant recategorization of input results in a powerful autonomous neural network. See also artificial intelligence, cluster analysis, neural network."
    },
    {
      "title": "article ",
      "description": "n. A message that appears in an Internet newsgroup. Also called: post. See also newsgroup."
    },
    {
      "title": "articulation ",
      "description": "n. A series of adjustments applied by a synthesizer to the pitch, volume, and other parameters of an instrument sound to make it more realistic."
    },
    {
      "title": "artifact ",
      "description": "n. A visible imperfection or distortion in a digital image. Artifacts may be caused by hardware/software limitations or may be a byproduct of compression."
    },
    {
      "title": "artificial intelligence ",
      "description": "n. The branch of computer science concerned with enabling computers to simulate such aspects of human intelligence as speech recognition, deduction, inference, creative response, the ability to learn from experience, and the ability to make inferences given incomplete information. Two common areas of artificial-intelligence research are expert systems and natural-language processing. Acronym: AI.See also expert system, natural-language processing."
    },
    {
      "title": "artificial life ",
      "description": "n. The study of computer systems that simulate some aspects of the behavior of living organisms. Artificial life includes systems in which programs intended to perform some particular task compete for survival and reproduction based on their performance; the offspring can combine pieces of code and undergo random variations, and the programs so modified compete in turn, until an optimal solution is found."
    },
    {
      "title": "artificial neural network ",
      "description": "n. A form of computer artificial intelligence that uses software based on concepts understood from biological neural networks to adaptively perform a task. Acronym: ANN."
    },
    {
      "title": "AS ",
      "description": "n. See autonomous system."
    },
    {
      "title": ".asc ",
      "description": "n. A file name extension most commonly indicating that the file contains ASCII text that can be processed by all types of word processing software, including MS-DOS Edit, Windows Notepad, Windows 9x or Windows NT WordPad, and Microsoft Word. Some systems may use this extension to indicate that a file contains image information. See also ASCII."
    },
    {
      "title": "ascender ",
      "description": "n. The portion of a lowercase letter that extends above the main body (x-height) of the letter. See the illustration. See also base line, x-height. Compare descender."
    },
    {
      "title": "ascending order ",
      "description": "n. The arrangement of a sequence of items from lowest to highest, such as from 1 to 10 or from A to Z. The rules for determining ascending order in a particular application can be very complicated: capital letters before lowercase letters, extended ASCII characters in ASCII order, and so on."
    },
    {
      "title": "ascending sort ",
      "description": "n. A sort that results in the arrangement of items in ascending order. See also alphanumeric sort, ascending order. Compare descending sort."
    },
    {
      "title": "ascii ",
      "description": "n. In an FTP client program, the command that instructs the FTP server to send or receive files as ASCII text. See also ASCII, FTP client. Compare binary (2)."
    },
    {
      "title": "ASCII ",
      "description": "n. Acronym for American Standard Code for Information Interchange. A coding scheme using 7 or 8 bits that assigns numeric values to up to 256 characters, including letters, numerals, punctuation marks, control characters, and other symbols. ASCII was developed in 1968 to standardize data transmission among disparate hardware and software systems and is built into most minicomputers and all PCs. ASCII is divided into two sets: 128 characters (standard ASCII) and an additional 128 (extended ASCII). See also ASCII file, character, character code, control character, extended ASCII, standard ASCII. Compare EBCDIC."
    },
    {
      "title": "ASCII character set ",
      "description": "n. A standard 7-bit code for representing ASCII characters using binary values; code values range from 0 to 127. Most PC-based systems use an 8-bit extended ASCII code, with an extra 128 characters used to represent special symbols, foreign-language characters, and graphic symbols. See also ASCII, character, EBCDIC, extended ASCII, standard ASCII."
    },
    {
      "title": "ASCII EOL value ",
      "description": "n. The sequence of bytes that indicates the end of a line of text. For Windows and MS-DOS systems, this is the hexadecimal sequence 0D 0A or the decimal sequence 13 10. Data files imported from other kinds of computers might not display correctly if the software used is not capable of recognizing these differences and adjusting for them. See also ASCII, EOL."
    },
    {
      "title": "ASCII file ",
      "description": "n. A document file in ASCII format, containing characters, spaces, punctuation, carriage returns, and sometimes tabs and an end-of-file marker, but no formatting information. Also called: ASCII file, text file, text-only file. See also ASCII, text file. Compare binary file."
    },
    {
      "title": "ASCII transfer ",
      "description": "n. The preferred mode of electronic exchange for text files. In ASCII mode, character conversions to and from the network-standard character set are performed. See also ASCII. Compare binary transfer."
    },
    {
      "title": "ASCIIZ string ",
      "description": "n. In programming, an ASCII string terminated by the NULL character (a byte containing the character whose ASCII value is 0). Also called: null-terminated string."
    },
    {
      "title": "ASF ",
      "description": "n. See Advanced Streaming Format."
    },
    {
      "title": "Asian-Pacific Network Information Center ",
      "description": "n. See APNIC."
    },
    {
      "title": "ASIC ",
      "description": "n. Acronym for application-specific integrated circuit. See also gate array."
    },
    {
      "title": "ASK ",
      "description": "n. See amplitude shift keying."
    },
    {
      "title": "ASN ",
      "description": "n. Acronym for autonomous-system number. See autonomous system."
    },
    {
      "title": "ASN.1 ",
      "description": "n. See Abstract Syntax Notation One."
    },
    {
      "title": ".asp ",
      "description": "n. A file extension that identifies a Web page as an Active Server Page."
    },
    {
      "title": "ASP ",
      "description": "n. 1. See Active Server Pages. 2. See application service provider."
    },
    {
      "title": "aspect ratio ",
      "description": "n. In computer displays and graphics, the ratio of the width of an image or image area to its height. An aspect ratio of 2:1, for example, indicates that the image is twice as wide as it is high. The aspect ratio is an important factor in maintaining correct proportions when an image is printed, rescaled, or incorporated into another document."
    },
    {
      "title": "ASPI ",
      "description": "n. See Advanced SCSI Programming Interface."
    },
    {
      "title": "ASP.NET ",
      "description": "n. A set of technologies in the Microsoft .NET Framework for building Web applications and XML Web services. ASP.NET pages execute on the server and generate markup (such as HTML, WML, or XML) that is sent to a desktop or mobile browser. ASP.NET pages use a compiled, event-driven programming model that improves performance and enables the separation of application logic and user interface. ASP.NET pages and XML Web services files created using ASP.NET contain server-side (rather than client-side) logic written in Visual Basic .NET, C# .NET, or any .NET-compatible language. Web applications and XML Web services take advantage of the features of the common language runtime, such as type safety, inheritance, language interoperability, versioning, and integrated security."
    },
    {
      "title": "ASP.NET server control ",
      "description": "n. A server-side component that encapsulates user-interface and related functionality. An ASP.NET server control derives directly or indirectly from the System.Web.UI.Control class. The superset of ASP.NET server controls includes Web server controls, HTML server controls, and mobile controls. The page syntax for an ASP.NET server control includes a runat=”server” attribute on the control’s tag. See also Web server control, HTML server control, validation server controls."
    },
    {
      "title": "ASP.NET Web application ",
      "description": "n. An application that processes HTTP requests (Web requests) and executes on top of the ASP.NET runtime. An ASP.NET application can include ASP.NET pages, XML Web services, HTTP handlers, and HTTP modules."
    },
    {
      "title": "ASR ",
      "description": "n. 1. See automatic system reconfiguration. 2. Acronym for Automatic Speech Recognition. Technology which allows machines to recognize and respond to human voice commands. ASR systems may be used to control a computer or to operate word processing and similar applications. Many ASR products are designed for use by users with disabilities who might have difficulty using a keyboard or mouse."
    },
    {
      "title": "assemble ",
      "description": "vb. In programming, to convert an assembly language program to equivalent machine language instructions called object code. See also assembler, assembly language, linker, object code."
    },
    {
      "title": "assembler ",
      "description": "n. A program that converts assembly language programs, which are understandable by humans, into executable machine language. See also assemble, assembly language, assembly listing, compiler (definition 2), machine code."
    },
    {
      "title": "assembly ",
      "description": "n. A collection of one or more files that are versioned and deployed as a unit. An assembly is the primary building block of a .NET Framework application. All managed types and resources are contained within an assembly and are marked either as accessible only within the assembly or as accessible from code in other assemblies. Assemblies also play a key role in security. The code access security system uses information about the assembly to determine the set of permissions that code in the assembly is granted."
    },
    {
      "title": "assembly cache ",
      "description": "n. A machine-wide code cache used for side-by-side storage of assemblies. There are two parts to the cache: the global assembly cache contains assemblies that are explicitly installed to be shared among many applications on the computer; the download cache stores code downloaded from Internet or intranet sites, isolated to the application that triggered the download so that code downloaded on behalf of one application/page does not impact other applications. See also global assembly cache."
    },
    {
      "title": "assembly language ",
      "description": "n. A low-level programming language using abbreviations or mnemonic codes in which each statement corresponds to a single machine instruction. An assembly language is translated to machine language by the assembler and is specific to a given processor. Advantages of using an assembly language include increased execution speed and direct programmer interaction with system hardware. See also assembler, compiler, high-level language, low-level language, machine code."
    },
    {
      "title": "assembly listing ",
      "description": "n. A file created by an assembler that includes the statements of an assembly language program, the machine language generated by the assembler, and a list of the symbols used in the program. See also assembler, assembly language."
    },
    {
      "title": "assertion ",
      "description": "n. A Boolean statement used in a program to test a condition that, if the program is operating correctly, should always evaluate as true; otherwise the program will typically terminate with an appropriate error message. Assertions are used for debugging programs and for documenting how a program should operate."
    },
    {
      "title": "assignment operator ",
      "description": "n. An operator used to assign a value to a variable or data structure. See also assignment statement, operator (definition 1)."
    },
    {
      "title": "assignment statement ",
      "description": "n. A programming language statement used to assign a value to a variable. It usually consists of three elements: an expression to be assigned, an assignment operator (typically a symbol such as = or :=), and a destination variable. On execution of the assignment statement, the expression is evaluated and the resulting value is stored in the specified destination. See also assignment operator, expression, variable."
    },
    {
      "title": "associate ",
      "description": "vb. To inform the operating system that a particular file name extension is linked to a specific application. When a file is opened that has an extension associated with a given application, the operating system automatically starts the application and loads the file."
    },
    {
      "title": "Association Control Service Element ",
      "description": "n. An Open Systems Interconnection (OSI) method to establish a call between two applications by checking the identities and contexts of the application entities and performing an authentication security check. Acronym: ACSE.See also ISO/OSI reference model."
    },
    {
      "title": "Association for Computing Machinery ",
      "description": "n. A membership society founded in 1947 and devoted to the advancement of knowledge and technical proficiency of information processing professionals. Acronym: ACM."
    },
    {
      "title": "Association of C and C++ Users ",
      "description": "n. An organization of people interested in the programming language C and its variants. Members of the association include professional programmers, manufacturers and vendors of compilers, and nonprofessional programming enthusiasts. Acronym: ACCU."
    },
    {
      "title": "associative storage ",
      "description": "n. A memory-based storage method in which data items are accessed not on the basis of a fixed address or location but by analysis of their content. Also called: content-addressed storage."
    },
    {
      "title": "associativity ",
      "description": "n. See operator associativity."
    },
    {
      "title": "asterisk ",
      "description": "n. See *."
    },
    {
      "title": "asymmetrical transmission ",
      "description": "n. A form of transmission used by high-speed modems, typically those that operate at rates of 9600 bps or more, that allows simultaneous incoming and outgoing transmission by dividing a telephone line bandwidth into two channels: one in the range of 300 to 450 bps and one at a speed of 9600 bps or more."
    },
    {
      "title": "asymmetric digital subscriber line ",
      "description": "n. See ADSL."
    },
    {
      "title": "asymmetric digital subscriber loop ",
      "description": "n. See ADSL."
    },
    {
      "title": "asymmetric modem ",
      "description": "n. A modem that transmits data to the telephone network and receives data from the network at different speeds. Most commonly, an asymmetric modem will have a maximum download speed substantially higher than its upload speed. See also modem."
    },
    {
      "title": "asynchronous ",
      "description": "adj. Pertaining to, being, or characteristic of something that is not dependent on timing. For example, asynchronous communications can start and stop at any time instead of having to match the timing governed by a clock."
    },
    {
      "title": "asynchronous chip ",
      "description": "n. A microprocessor chip that does not need to operate in sync with a system clock. Asynchronous chip operations do not need to be timed to clock speed and draw power only when operations are in progress. This allows asynchronous chips the potential for greater computational speed and lower power consumption than traditional chips."
    },
    {
      "title": "asynchronous communications ",
      "description": "n. Computer-to-computer communications in which the sending and receiving computers do not rely on timing as a means of determining where transmissions begin and end. Compare synchronous communications."
    },
    {
      "title": "asynchronous device ",
      "description": "n. A device whose internal operations are not synchronized with the timing of any other part of the system."
    },
    {
      "title": "asynchronous operation ",
      "description": "n. An operation that proceeds independently of any timing mechanism, such as a clock. For example, two modems communicating asynchronously rely upon each sending the other start and stop signals in order to pace the exchange of information. Compare synchronous operation."
    },
    {
      "title": "asynchronous procedure call ",
      "description": "n. A function call that executes separately from an executing program when a set of enabling conditions exist. After the conditions have been met, the operating system’s kernel issues a software interrupt and directs the executing program to execute the call. Acronym: APC.See also function call."
    },
    {
      "title": "Asynchronous Protocol Specification ",
      "description": "n. The X.445 standard. See also X series."
    },
    {
      "title": "asynchronous static RAM ",
      "description": "n. A type of static RAM (SRAM) that is not synchronized with the system clock. Like static RAM in general, asynchronous static RAM, or async SRAM, is used in a computer’s L2 cache—the special portion of memory used for storing frequently accessed information. Because this type of static RAM is not synchronized with the clock, the CPU must wait for data requested from the L2 cache. Asynchronous static RAM is faster than main memory but not as fast as synchronous burst static RAM or pipeline burst static RAM. Also called: async SRAM. See also L2 cache, static RAM. Compare dynamic RAM, pipeline burst static RAM, synchronous burst static RAM."
    },
    {
      "title": "Asynchronous Transfer Mode ",
      "description": "n. See ATM (definition 1)."
    },
    {
      "title": "asynchronous transmission ",
      "description": "n. In modem communication, a form of data transmission in which data is sent intermittently, one character at a time, rather than in a steady stream with characters separated by fixed time intervals. Asynchronous transmission relies on the use of a start bit and stop bit(s), in addition to the bits representing the character (and an optional parity bit), to distinguish separate characters. See the illustration."
    },
    {
      "title": "async SRAM ",
      "description": "n. See asynchronous static RAM."
    },
    {
      "title": "AT&T System V ",
      "description": "n. See System V."
    },
    {
      "title": "ATA ",
      "description": "n. Acronym for Advanced Technology Attachment. ANSI group X3T10’s official name for the disk drive interface standard for integrating drive controllers directly on disk drives. The original ATA standard is commonly known as Integrated Drive Electronics (IDE). Later ATA versions include ATA-2, ATA-3, and Ultra-ATA. See the table. Also called: AT attachment. See also direct memory access, EIDE, IDE, logical block addressing, PIO, SMART system."
    },
    {
      "title": "ATA hard disk drive card ",
      "description": "n. Expansion card used to control and interface with an ATA hard disk drive. These cards are usually ISA cards. See also ATA, ISA."
    },
    {
      "title": "ATA/IDE hard disk drive ",
      "description": "n. ATA (Advanced Technology Attachment) and IDE (Integrated Drive Electronics or numerous other interpretations) are one and the same thing: a disk drive implementation designed to integrate the controller onto the drive itself, thereby reducing interface costs and making firmware implementations easier."
    },
    {
      "title": "ATAPI ",
      "description": "n. The interface used by the IBM PC AT system for accessing CD-ROM devices."
    },
    {
      "title": "AT Attachment ",
      "description": "n. See ATA."
    },
    {
      "title": "AT bus ",
      "description": "n. The electric pathway used by IBM AT and compatible computers to connect the motherboard and peripheral devices. The AT bus supports 16 bits of data, whereas the original PC bus supports only 8 bits. Also called: expansion bus. See also EISA, ISA, Micro Channel Architecture."
    },
    {
      "title": "aTdHvAaNnKcSe ",
      "description": "n. See TIA."
    },
    {
      "title": "ATDP ",
      "description": "n. Acronym for Attention Dial Pulse, a command that initiates pulse (as opposed to touch-tone) dialing in Hayes and Hayes-compatible modems. Compare ATDT."
    },
    {
      "title": "ATDT ",
      "description": "n. Acronym for Attention Dial Tone, a command that initiates touch-tone (as opposed to pulse) dialing in Hayes and Hayes-compatible modems. Compare ATDP."
    },
    {
      "title": "Athlon ",
      "description": "n. Family of x86-compatible processors introduced by Advanced Micro Devices, Inc. (AMD) in 1999. Athlon, which was code-named AMD-K7, is a successor to the AMD-K6 family. Comparable to upper-end Intel Pentium III processors in performance, Athlon is distinguished by over 22 million transistors; a fully pipelined, superscalar floating-point engine, which enhances performance of graphics and multimedia programs, Internet streaming applications, and games; a 200-MHz system bus; and a 128-KB L1 cache. Although the L2 cache is 512 KB in size, the Athlon can support L2 cache sizes up to 8 MB. The first Athlon releases featured clock speeds of 500 to 650 MHz; 800-MHz and faster versions are now available. Athlon, which runs 32-bit programs, is compatible with most PC operating systems, including Microsoft Windows, Linux, OS/2 Warp, and NetWare. See also AMD-K6."
    },
    {
      "title": "ATM ",
      "description": "n. 1. Acronym for Asynchronous Transfer Mode. A network technology capable of transmitting data, voice, audio, video, and frame relay traffic in real time. Data, including frame relay data, is broken into packets containing 53 bytes each, which are switched between any two nodes in the system at rates ranging from 1.5 Mbps to 622 Mbps (over fiber optic cable). The basic unit of ATM transmission is known as a cell, a packet consisting of 5 bytes routing information and a 48-byte payload (data). These cells are transmitted to their destination, where they are reassembled into the original traffic. During transmission, cells from different users may be intermixed asynchronously to maximize utilization of network resources. ATM is defined in the broadband ISDN protocol at the levels corresponding to levels 1 and 2 of the ISO/OSI reference model. It is currently used in LANs (local area networks) involving workstations and personal computers, but it is expected to be adopted by the telephone companies, which will be able to charge customers for the data they transmit rather than for their connect time. See also broadband, ISDN, ISO/OSI reference model. 2. Acronym for automated teller machine. A special-purpose terminal that bank customers can use to make deposits, obtain cash, and perform other transactions. 3. See Adobe Type Manager."
    },
    {
      "title": "ATM Adaptation Layer ",
      "description": "n. The ATM layer that mediates between higher-level and lower-level services, converting different types of data (such as audio, video, and data frames) to the 48-byte payloads required by ATM. Acronym: AAL.See also ATM (definition 1)."
    },
    {
      "title": "ATM Forum ",
      "description": "n. Forum created in 1991 and including more than 750 companies related to communications and computing, as well as government agencies and research groups. The forum aims to promote Asynchronous Transfer Mode for data communication. See also ATM (definition 1)."
    },
    {
      "title": "Atomicity, Consistency, Isolation, Durability ",
      "description": "n. See ACID."
    },
    {
      "title": "atomic operation ",
      "description": "n. An operation considered or guaranteed to be indivisible (by analogy with an atom of matter, once thought to be indivisible). Either the operation is uninterruptible or, if it is aborted, a mechanism is provided that ensures the return of the system to its state prior to initiation of the operation."
    },
    {
      "title": "atomic transaction ",
      "description": "n. A set of operations that follow an “all or nothing” principle, in which either all of the operations are successfully executed or none of them is executed. Atomic transactions are appropriate for order entry and fulfillment or for money transfers to ensure that information is fully updated. For example, if funds are transferred between accounts on two databases, one account cannot be credited if the other is not debited by the same amount. An atomic transaction would involve both recording the credit in one database and recording the corresponding debit in the other. If any operation in the transaction fails, the transaction is aborted and any information changes are undone. See also Distributed Computing Environment, TP monitor, transaction processing."
    },
    {
      "title": "at sign ",
      "description": "n. See @."
    },
    {
      "title": "attach ",
      "description": "vb. To include an external document, a file, or an executable program with an e-mail message."
    },
    {
      "title": "attached document ",
      "description": "n. An ASCII text file or a binary file, such as a document created in a word processing system, that is included with an e-mail message as an attachment. See also ASCII, attachment, binary file, BinHex1, MIME, uuencode."
    },
    {
      "title": "attached file ",
      "description": "n. See attachment."
    },
    {
      "title": "attached processor ",
      "description": "n. A secondary processor attached to a computer system, such as a keyboard or video subsystem processor."
    },
    {
      "title": "Attached Resource Computer Network ",
      "description": "n. See ARCnet."
    },
    {
      "title": "attachment ",
      "description": "n. A file that accompanies an e-mail message. As transmitted, an attached file is an exact copy of the original file located on the sender’s computer. The file can be a document, an executable program, or a compressed file containing more than one item, among other types of files. The file is not part of the actual e-mail message, and it is generally encoded using uuencoding, MIME, or BinHex. Most e-mail programs automatically encode an attached document for transmission with a message. The recipient of the message must have an e-mail program capable of decoding the attached document or use a separate utility to decode it in order to read the document. Some gateways prohibit transmission of files over a certain size. Most e-mail systems permit more than one file to be attached to an e-mail message at a time."
    },
    {
      "title": "attachment unit interface ",
      "description": "n. See AUI."
    },
    {
      "title": "attenuation ",
      "description": "n. The weakening of a transmitted signal, such as the distortion of a digital signal or the reduction in amplitude of an electrical signal, as it travels farther from its source. Attenuation is usually measured in decibels and is sometimes desirable, as when signal strength is reduced electronically, for example, by a radio volume control, to prevent overloading."
    },
    {
      "title": "atto- ",
      "description": "prefix Metric prefix meaning 10exp–18 (one quintillionth)."
    },
    {
      "title": "attract mode ",
      "description": "n. In commercial arcade games, when a coin-operated game is not in use, the screen will rotate through “attract mode.” The aim is to both tempt prospective players and demonstrate game play or rules. Also, by constantly changing the screen image, attract mode avoids screen burn in. See also arcade game, burn in."
    },
    {
      "title": "attribute ",
      "description": "n. 1. In a database record, the name or structure of a field. For example, the files LASTNAME, FIRSTNAME, and PHONE would be attributes of each record in a PHONELIST database. The size of a field or the type of information it contains would also be attributes of a database record. 2. In screen displays, an element of additional information stored with each character in the video buffer of a video adapter running in character mode. Such attributes control the background and foreground colors of the character, underlining, and blinking. 3. In markup languages such as SGML and HTML, a name-value pair within a tagged element that modifies certain features of that element. See also HTML, SGML."
    },
    {
      "title": "attribution line ",
      "description": "n. In newsgroups, e-mail, and other Internet-based communications, an identification line added to material quoted from earlier postings. Some mail and messaging software will add an attribution line automatically, which might read something like “News King wrote:” and usually appears immediately before the quoted text."
    },
    {
      "title": "ATX ",
      "description": "n. A specification for PC motherboard architectures with built-in audio and video capabilities, introduced by Intel in 1995. ATX supports USB and full-length boards in all sockets. See also board, motherboard, specification, USB."
    },
    {
      "title": "audio ",
      "description": "adj. Relating to frequencies within the range of perception by the human ear—from about 15 to 20,000 hertz (cycles per second). See also audio response, synthesizer."
    },
    {
      "title": "audio board ",
      "description": "n. See sound card."
    },
    {
      "title": "audio card ",
      "description": "n. See sound card."
    },
    {
      "title": "audiocast ",
      "description": "n. The transmission of an audio signal using IP protocols. See also IP."
    },
    {
      "title": "audio compression ",
      "description": "n. A method of reducing the overall loudness of an audio signal. This is accomplished by limiting the amount of apparent distortion when the signal is played back through a speaker or transmitted through a communications link."
    },
    {
      "title": "audio output ",
      "description": "n. See audio response."
    },
    {
      "title": "audio output port ",
      "description": "n. A circuit consisting of a digital-toanalog converter that transforms signals from the computer to audible tones. It is used in conjunction with an amplifier and a speaker. See also digital-to-analog converter."
    },
    {
      "title": "audio response ",
      "description": "n. Any sound produced by a computer; specifically, spoken output produced by a computer in response to some specific type of input. Such output may be generated using a combination of words from a digitized vocabulary or through the synthesis of words from tables of phonemes. See also frequency response, phoneme."
    },
    {
      "title": "audiotex ",
      "description": "n. An application allowing users to send and receive information by telephone. Users typically call an audiotex system and are presented with a series of choices or a series of questions through a voice mail system. When users select choices by pressing the buttons on the phone (rotary dial phones cannot be used for audiotex) or by speaking aloud, a database host responds by sending information to the voice mail system, which then converts the data to a spoken message for the user, or it responds by receiving and storing the information entered by the user. Also called: audiotext. See also voice mail."
    },
    {
      "title": "audiotext ",
      "description": "n. See audiotex."
    },
    {
      "title": "Audio Video Interleaved ",
      "description": "n. See AVI."
    },
    {
      "title": "audiovisual ",
      "description": "adj. Relating to or being any material that uses a combination of sight and sound to present information."
    },
    {
      "title": "audit ",
      "description": "n. In reference to computing, an examination of equipment, programs, activities, and procedures to determine how efficiently the overall system is performing, especially in terms of ensuring the integrity and security of data."
    },
    {
      "title": "auditing ",
      "description": "n. The process an operating system uses to detect and record security-related events, such as an attempt to create, to access, or to delete objects such as files and directories. The records of such events are stored in a file known as a security log, whose contents are available only to those with the proper clearance. See also security log."
    },
    {
      "title": "audit policy ",
      "description": "n. A policy that determines the security events to be reported to the network administrator."
    },
    {
      "title": "audit trail ",
      "description": "n. In reference to computing, a means of tracing all activities affecting a piece of information, such as a data record, from the time it is entered into a system to the time it is removed. An audit trail makes it possible to document, for example, who made changes to a particular record and when."
    },
    {
      "title": "AUI ",
      "description": "n. 1. Acronym for attachment unit interface. A 15- pin (DB-15) connector commonly used to connect a network interface card to an Ethernet cable. 2. See aural user interface."
    },
    {
      "title": "AUI cable ",
      "description": "n. Short for Attachment Unit Interface cable. A transceiver cable used to connect a host adapter within a computer to an Ethernet (10base5 or 10BaseF) network. See also 10Base5, 10Base-F, Ethernet (definition 1), transceiver cable."
    },
    {
      "title": "AUP ",
      "description": "n. See acceptable use policy."
    },
    {
      "title": "aural user interface ",
      "description": "n. Voice-activated interface that allows users to issue spoken commands to electronic devices. The aural user interface is used with features such as voice recognition for computers and voice-activated dialing for wireless phones. Acronym: AUI."
    },
    {
      "title": "authentication ",
      "description": "n. In a multiuser or network operating system, the process by which the system validates a user’s logon information. A user’s name and password are compared against an authorized list, and if the system detects a match, access is granted to the extent specified in the permission list for that user. See also logon, password, permission, user account, user name."
    },
    {
      "title": "authentication center ",
      "description": "n. Secure database used to identify and prevent wireless phone fraud. Authentication centers verify whether a wireless phone is registered with a wireless carrier’s network."
    },
    {
      "title": "Authentication Header ",
      "description": "n. See AH."
    },
    {
      "title": "Authenticode ",
      "description": "n. A security feature of Microsoft Internet Explorer. Authenticode allows vendors of downloadable executable code (plug-ins or ActiveX controls, for example) to attach digital certificates to their products to assure end users that the code is from the original developer and has not been altered. Authenticode lets end users decide for themselves whether to accept or reject software components posted on the Internet before downloading begins. See also ActiveX control, Internet Explorer, security."
    },
    {
      "title": "author (1)",
      "description": "vb. 1. To create a product for implementation via computer technology. 2. To write a computer program. 3. To assemble multimedia components, such as graphics, text, audio, and animation, in a publication or product, for delivery on a CD-ROM or DVD or on line, to be viewed on a computer. 4. To create Web pages. Traditionally, to author meant to write a literary work or journalistic piece; in the cyberworld, to write is “to provide content”; thus, to author in the traditional sense is to be a “content provider.”"
    },
    {
      "title": "author (2)",
      "description": "n. See Web author."
    },
    {
      "title": "authoring language ",
      "description": "n. A computer language or application development system designed primarily for creating programs, databases, and materials for computer-aided instruction (CAI). A familiar example in relation to microcomputers is PILOT, a language used to create lessons. See also CAI, PILOT."
    },
    {
      "title": "authoring software ",
      "description": "n. A type of computer program used for creating Web pages and other hypertext and multimedia applications. Authoring software provides a way to define relationships between different types of objects, including text, graphics, and sound, and to present them in a desired order. This type of program is sometimes known as authorware, although the latter name is generally associated with a specific product from Macromedia. Also called: authoring tool."
    },
    {
      "title": "authoring system ",
      "description": "n. Application software that enables the operator to create and format a document for a specific kind of computer environment. An authoring system, especially for multimedia work, often consists of several applications within the framework of a single, controlling application. See also authoring language."
    },
    {
      "title": "authority ",
      "description": "n. A DNS server responsible for resolving names and IP addresses of sites and resources on the Internet at a particular level of authority: top-level domain, second-level domain, or subdomain."
    },
    {
      "title": "authorization ",
      "description": "n. In reference to computing, especially remote computers on a network, the right granted an individual to use the system and the data stored on it. Authorization is typically set up by a system administrator and verified by the computer based on some form of user identification, such as a code number or password. Also called: access privileges, permission. See also network, system administrator."
    },
    {
      "title": "authorization code ",
      "description": "n. See password."
    },
    {
      "title": "autoanswer ",
      "description": "n. See answer mode."
    },
    {
      "title": "autoassociative ",
      "description": "adj. In data reduction or clustering, autoassociative models use the same set of variables as both predictors and targets. In autoassociative neural networks, each pattern presented serves as both the input and output pattern. Autoassociative networks are typically used for tasks involving pattern completion. See also artificial intelligence, cluster analysis, neural networks, operator associativity, pattern recognition."
    },
    {
      "title": "autoattendant ",
      "description": "adj. A term used to describe a store-and-forward computer system that replaces the traditional switchboard operator, directing telephone calls to their correct extensions or voice mail. Autoattendant systems may implement voice prompts, touch-tone menus, or voice recognition features to send calls to their proper destinations. Compare interactive voice response systems."
    },
    {
      "title": "AutoCorrect ",
      "description": "n. A function in Microsoft Word for Windows that automatically corrects errors and makes other substitutions as soon as a user types text. For example, AutoCorrect can be set up to fix misspellings, such as teh for the, or to change “straight” (\" \") quotation marks to “smart” (“ ”) quotation marks. The user can select which AutoCorrect features to enable. See also smart quotes."
    },
    {
      "title": "",
      "description": ""
    }
  ]
}

